In [1]:
import pandas as pd

In [2]:
data = [[1,2,3],[4,5,6],[7,8,9]]

In [3]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
list('321')

['3', '2', '1']

In [5]:
df = pd.DataFrame(data,list('321'),list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [6]:
df.sort_index(inplace = True)

In [7]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [14]:
df.sort_index(inplace = True, axis = 1)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [15]:
df.sort_values(by = 'X', inplace = True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [10]:
df.sort_values(by = '3', axis=1, inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

## Exemplo 1

In [16]:
data = [[9,6,3],[8,5,2],[7,4,1]]
data

[[9, 6, 3], [8, 5, 2], [7, 4, 1]]

In [26]:
df2 = pd.DataFrame(data, list('ZYX'), list('CBA'))
df2

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [27]:
df2.sort_index()
df2.sort_index(axis=1)
df2

   C  B  A
Z  9  6  3
Y  8  5  2
X  7  4  1

In [28]:
df2.sort_index(inplace=True)
df2.sort_index(axis=1, inplace=True)
df2

   A  B  C
X  1  4  7
Y  2  5  8
Z  3  6  9